app/views/pages/index.html.erb

    <li>  SCHOOLS: </li>
    <% p.schools.each do |s| %>
---
SELECT "schools".* FROM "schools"

    <li>  DEGREES: </li>
    <% p.educations.each do |e| %>
---
SELECT "educations".* FROM "educations" ORDER BY "educations"."id" DESC LIMIT 1