app/controllers/pages_controller.rb

SELECT "companies".* FROM "companies"
SELECT "educations".* FROM "educations" ORDER BY "educations"."id" DESC LIMIT 1
SELECT "schools".* FROM "schools"
SELECT "industries".* FROM "industries"
SELECT "locations".* FROM "locations"
---
  def index
    # Populate.new
    @companies = Company.all
    @people = Person.all
    @educations = Education.all
    @schools = School.all
    @industries = Industry.all
    @locations = Location.all